/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 16:10:32 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 15:37:35 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция isascii() проверяет наличие символа ASCII, который является любым
** символом от 0 до восьмеричного 0177 включительно.
**
** RETURN
**
** Функция isascii() возвращает ноль, если символ тестирует false,
** и возвращает
** ненулевое значение, если символ тестирует true.
*/

int	ft_isascii(int ch)
{
	if (ch >= 0 && ch <= 127)
	{
		return (1);
	}
	return (0);
}
