/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 14:49:32 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 15:41:19 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция isprint() проверяет наличие любого печатного символа,
** включая пробел (` '). Значение аргумента должно быть представлено
** как символ без знака или
** значение EOF.
**
** RETURN
**
** Функция isprint() возвращает ноль, если символ тестирует false,
** и возвращает ненулевое значение, если символ тестирует true.
*/

int	ft_isprint(int ch)
{
	if (ch >= 32 && ch <= 126)
	{
		return (1);
	}
	return (0);
}
