/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalpha.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 17:22:07 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 15:29:33 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция проверяет является ли символ
** символом из алфавита (англ)
**
** RETURN
**
** Функция isalpha() возвращает ноль, если символ тестирует false,
** и возвращает
** ненулевое значение, если символ тестирует true.
*/

int	ft_isalpha(int ch)
{
	if ((ch >= 65 && ch <= 90) || (ch >= 97 && ch <= 122))
	{
		return (1);
	}
	return (0);
}
