/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 17:16:42 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 15:29:53 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция isdigit() проверяет наличие десятичного значного символа. Независимо
** от локали, это включает только следующие символы:
**
** RETURN
**
** Возвращают ноль, если символ тестирует false, и ненулевой,
** если символ тестирует true.
*/

int	ft_isdigit(int ch)
{
	if (ch >= 48 && ch <= 57)
	{
		return (1);
	}
	return (0);
}
