/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 16:18:36 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 16:51:55 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция isalnum() проверяет любой символ, для которого isalpha(3)
** или isdigit(3) истинны.
**
** RETURN
**
** Функция isalnum() возвращает ноль, если символ тестирует false,
** и возвращает ненулевое значение, если символ тестирует true.
*/

int	ft_isalnum(int ch)
{
	if (ft_isalpha(ch) || ft_isdigit(ch))
	{
		return (1);
	}
	return (0);
}
