/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstnew.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 22:48:51 by bmarilli          #+#    #+#             */
/*   Updated: 2020/11/01 22:57:54 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Выделяет (с помощью malloc(3)) и возвращает новый
** элемент. Переменная "content" инициализируется
** значением параметра " content’.
** Переменная ’next’ инициализируется значением NULL.
*/

t_list	*ft_lstnew(void *content)
{
	t_list	*el;

	if (!(el = (t_list*)malloc(sizeof(t_list))))
		return (NULL);
	el->content = content;
	el->next = NULL;
	return (el);
}
