/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstdelone.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 23:45:33 by bmarilli          #+#    #+#             */
/*   Updated: 2020/11/01 23:50:14 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** del -> Адрес функции, используемой для удаления
** содержимого.
** Принимает в качестве параметра элемент и освобождает
** память содержимого элемента, используя функцию
** ’del’, заданную в качестве параметра, и освобождает элемент.
** Память о "следующем" не должна быть освобождена.
*/

void	ft_lstdelone(t_list *lst, void (*del)(void*))
{
	if (!lst || !del)
		return ;
	del(lst->content);
	free(lst);
}
