/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 14:30:32 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 15:47:03 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция tolower() преобразует прописную букву в соответствующую строчную
** букву. Аргумент должен быть представлен в виде символа без знака или
** значения EOF.
**
** RETURN
**
** Если аргумент является буквой верхнего регистра, функция tolower()
** возвращает соответствующую букву нижнего регистра, если она существует;
** в противном случае аргумент
** возвращается без изменений.
*/

int	ft_tolower(int ch)
{
	if (ch >= 65 && ch <= 90)
	{
		return (ch + 32);
	}
	return (ch);
}
