/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmarilli <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 14:38:50 by bmarilli          #+#    #+#             */
/*   Updated: 2020/10/30 15:43:54 by bmarilli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ENG
*/

/*
** RUS
**
** Функция toupper() преобразует строчную букву в соответствующую заглавную
**  букву. Аргумент должен быть представлен в виде символа без знака или
** значения EOF.
**
** RETURN
**
** Если аргумент является строчной буквой, функция toupper() возвращает
** соответствующую заглавную букву, если таковая имеется;
** в противном случае аргумент
** возвращается без изменений.
*/

int	ft_toupper(int ch)
{
	if (ch >= 97 && ch <= 122)
	{
		return (ch - 32);
	}
	return (ch);
}
